<?php

$a = 2;
$b = 3;

echo "Сумма чисел $a и $b = ".($a + $b)."<br>";
echo "Произведение чисел $a и $b = ".($a * $b)."<br>";

echo "Сумма квадратов чисел $a и $b = ".(($a *= $a) + ($b *= $b))."<br>";

$a = 2;
$b = 3;
$c = 4;
echo "Средне арифметическое чисел $a, $b и $c = ".(($a + $b + $c) / 3)."<br>";

$a = 11;
echo "Остаток от деления $a на 3 = ".($a%3)."<br>";
echo "Остаток от деления $a на 5 = ".($a%5)."<br>";

$a = 200;
echo "Если увеличить число $a на 30% будет ".($a / 100 * 130)."<br>";
echo "Если увеличить число $a на 120% будет ".($a / 100 * 220)."<br>";

$a = 100;
$b = 100;
echo "Если 40% от числа $a сложить с 84% от числа $b получится ".(($a / 100 * 40) + ($b / 100 * 84))."<br>";