<?php

function speed ($dis, $tim) {
    if (($dis [1] <= 3) && ($dis [1] >= 1) && ($tim [1] <= 3) && ($tim [1] >= 1)) { // Проверка что второй параметр указан верно
        $units = [1, 1000, 1609.34, 1, 60, 3600];  //Первые три элемента количество метров в м/км/милях
        //Последние три кол-во секунд в сек/мин/ч

        $result = ($dis [0] * $units [$dis [1] - 1]) / ($tim [0] * $units [$tim [1] + 2]);
        //(Перевожу введенный первый массив в метры) / (второй в секунды) = м/с

        return ("Скорость составляет " . $result / 0.277777777777778 . " км/ч или же {$result} м/с");
    }
    else {
        return ("error");
    }
}
//----------------------------------------------------------

$distance = [100, 2];    //1-ый параметр расстояние, 2-ой единица измерения (1 - в метрах, 2 - километрах, 3 - милях)
$time = [1, 3];          //1-ый параметр время, 2-ой единица измерения (1 - в секундах, 2 - минутах, 3 - часах)

//----------------------------------------------------------

echo speed($distance, $time);